[
    { 
      "id":1,
      "role": "Data Science Engineer",
      "company": "Iktara Data Sciences",
      "duration": "Jan 2024 - Present",
      "link": "https://iktara.ai",
      "description": "Developing the Airtel Transmission System and creating an inventory data storage pipeline for Airtel. Responsible for detecting configuration changes and building dashboards for model training."
    },
    { 
      "id":2,
      "role": "Technical Writer",
      "company": "Hashnode",
      "duration": "Feb 2023 - Present",
      "link":"https://vgandhi27.hashnode.dev/",
      "description": "Being a technical writer on Hashnode gives me an exciting opportunity to share my learning in Public. I often write tech blogs on various tech fields."
    },
    { 
      "id":3,
      "role": "Youtube Content Creator",
      "company": "Youtube",
      "duration": "Jan 2023 - Present",
      "link":"https://www.youtube.com/@spanningtreee",
      "description": "Developed and produced educational tech content focused on computer science concepts, data structures, algorithms, and system design. Built a growing community by delivering insightful tutorials, hands-on coding walkthroughs, and industry-focused discussions. Managed end-to-end video production, including scripting, recording, editing, and audience engagement, while optimizing for reach and retention."
    },
    { 
      "id":4,
      "role": "Google GDSC Technical Lead",
      "company": "Google Developer Students Club",
      "duration": "August 2023 - July 2024",
      "link":"/GDSC.pdf",
      "description": "Passionate and experienced GDSC Lead with a proven track record of organizing and leading successful tech events and initiatives. Proven ability to motivate and inspire others, as well as to build and manage high-performing teams. Expertise in software development and a strong interest in emerging technologies."
    },
    { 
      "id":5,
      "role": "Research Intern",
      "company": "Echelon Institute of Technology",
      "duration": "Jan 2023 - July 2024",
      "link":"/research",
      "description": "As a Research Intern, I contributed to academic research initiatives under the guidance of Dr. Stuti Saxena and Dr. Monica Garg. During this tenure, I co-authored and published two research papers:“SVM-Based Framework for Breast Cancer Detection” – This paper was presented at the COM-IT-Con ‘23 International Conference and published in Springer's Advances in Artificial-Business Analytics and Quantum Machine Learning.Another paper “Analysing the Causes of Mood Disorders: A Comprehensive Study” – A deep-dive research analyzing psychological and environmental factors contributing to mood disorders."
    },
    { 
      "id":6,
      "role": "Web Content Writer",
      "company": "Papersdrop",
      "duration": "April 2022 - February 2023",
      "link":"/papersdrop.pdf/",
      "description": "I completed my Content Writer Internship at Papersdrop! It was a great experience where I learned about various new technologies and developed essential skills.With the help and support of our papersdrop team, I publish 7 Blogs throughout this internship."
    },
    { 
      "id":7,
      "role": "Contributor @Hacktoberfest'23",
      "company": "Hacktoberfest",
      "duration": "September 2023 - November 2023",
      "link":"https://www.holopin.io/@vgandhi27#",
      "description": "Made an open-source contribution on Github in various repositories which helped me polish my skills at in Java, C, Python, Web Development and C++"
    },
    { 
      "id":8,
      "role": "Big Data and Hadoop Club — Core Team Member",
      "company": "Echelon Institute of Technology",
      "duration": "September 2022 - July 2023",
      "link":"https://eitfaridabad.com/",
      "description": "As a core team member of the Big Data and Hadoop Club, I contributed to organizing workshops, mentoring juniors, and managing club activities focused on data technologies. My responsibilities included developing front-end modules for data visualization, writing technical blogs, and collaborating on projects involving MongoDB and Hadoop ecosystems."
    },
    { 
      "id":9,
      "role": "Contributor @Hacktoberfest'22",
      "company": "Hacktoberfest",
      "duration": "October 2022 - November 2022",
      "link":"https://www.holopin.io/@vgandhi27#",
      "description": "Made an open-source contribution on Github in various repositories which helped me polish my Java, and C++ skills."
    },
    { 
      "id":10,
      "role": "Department Newsletter Committee — Member",
      "company": "Echelon Institute of Technology",
      "duration": "August 2021 - September 2022",
      "link":"https://eitfaridabad.com/",
      "description": "Served as an active member of the editorial committee, managing monthly newsletters for the department. I was involved in content planning, article editing, layout designing, and coordinating with faculty and students for contributions. Also contributed to front-end newsletter templates using HTML/CSS."
    },
    { 
      "id":11,
      "role": "Kshitij Club — Coordinator",
      "company": "Echelon Institute of Technology",
      "duration": "December 2020 - August 2021",
      "link":"https://eitfaridabad.com/",
      "description": "Led the Kshitij Club in organizing creative writing events, blogging competitions, and talent showcases. My role involved team coordination, event planning, and promotion, fostering a culture of self-expression and creativity within the college community."
    }
  ]
  